#Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Код представляет собой набор методов для работы с массивами строк:

EnterStrings: метод позволяет ввести количество строк через консоль и сохранить их в массиве.

CreatArray: метод принимает массив строк и создает новый, в котором только те строки, длина которых меньше или равна 3-м символам.

PrintArray: метод принимает массив строк и возвращает его строковое представление.

Проверка работы: 

Вызвать метод EnterStrings, ввести строки с консоли, сохранить их в массиве. 
Вызвать метод CreatArray, чтоб получить массив, со строками, длина которых меньше или равно 3-м символам. 
Вызвать метод PrintArray для строкового представления массивов.

Пример:
string[] workArray = EnterStrings();
string[] result = CreatArray(myArray);
string firstArray = PrintArray(myArray);
string secondArray = PrintArray(result);

Console.WriteLine(firstArray + " -> " + secondArray);
